import { isNumber } from "util";

// filter เลขที่มากกว่า 10
let array1 = [1, 2, 30, 400].filter(function(x) {
    return x > 10;
})
console.log(array1);
//#####################################################################################
//#####################################################################################

// filter เลขคี่
let array2 = [1, 2, 3, 4].filter(function(x) {
    return  (x % 2 !== 0)
})
console.log(array2);
//#####################################################################################
//#####################################################################################

// filter Number
let array3 = [1, "1", 2, {}].filter(function(x) {
  return x === parseInt(x)
})
console.log(array3);
//#####################################################################################
//#####################################################################################

// filter ตัวอักษร > 6
let array4 = ["apple", "banana", "orange", "pineapple", "watermeon"].filter(function(x) {
    return x.length > 6;
})
console.log(array4);
//#####################################################################################
//#####################################################################################

// filter age < 18
let array5 = [
    { name: "apple", age: 14 },
    { name: "banana", age: 18 },
    { name: "watermelon", age: 32 },
    { name: "pineapple", age: 16 },
    { name: "peach", age: 24 },
  ].filter(function(x) {
    return x.age < 18;
  })
console.log(array5);
//#####################################################################################
//#####################################################################################

// filter ไม่เอาคนที่อายุ 32
let array6 = [
    { name: "apple", age: 14 },
    { name: "banana", age: 18 },
    { name: "watermelon", age: 32 },
    { name: "pineapple", age: 16 },
    { name: "peach", age: 24 },
  ].filter(function(x) {
    return x.age !== 32
  })
console.log(array6);
//#####################################################################################
//#####################################################################################

// filter เลขบวก
let array7 = [1, -3, 2, 8, -4, 5].filter(function(x) {
    return x > 0;
})
console.log(array7);
//#####################################################################################
//#####################################################################################

// filter เลขหาร 3 ลงตัว
let array8 = [1,3,4,5,6,7,8].filter(function(x) {
    return x % 3 == 0;
})
console.log(array8);
//#####################################################################################
//#####################################################################################

// filter string
let array9 = ["peach", 1, -3, "2", {}, []].filter(function(x) {
    return x !== parseInt(x) && x !== Object(x)
})
console.log(array9);
//#####################################################################################
//#####################################################################################

// filter คำที่เป็นอักษรใหญ่ทุกตัว
let array10 = ["APPLE", "appLE", "PEACH", "PEach"].filter(function(x) {
    return x == x.toUpperCase();
})
console.log(array10);
//#####################################################################################
//#####################################################################################

// filter คนเกิดเดือน 10
let array11 = [
    { name: "apple", birth: "2001-01-01" },
    { name: "banana", birth: "1990-10-10" },
    { name: "watermelon", birth: "1985-12-30" },
    { name: "peach", birth: "2002-10-13" },
  ].filter(function(x) {
      let dueanTen;
      dueanTen = x.birth.includes("-10-")
    return dueanTen;
  })
console.log(array11);
//#####################################################################################
//#####################################################################################

// filter คนเกิดก่อนปี 2000
let array12 = [
    { name: "apple", birth: "2001-01-01" },
    { name: "banana", birth: "1990-10-10" },
    { name: "watermelon", birth: "1985-12-30" },
    { name: "peach", birth: "2002-10-13" },
  ].filter(function(x) {
      let before2000;
      return before2000 = x.birth.slice(0, 4) < 2000;
  })
console.log(array12);
