function getMaxSubSum(arr) {
  let maxSum = 0;
  let maxValue = 0;
  for (let value of arr) {
    arr; // array 4 รอบ
    value; // -1 , 2, 3, -9
    //value ได้ค่ามาปกติ
    maxSum += value;
    /* หลังจากเรารับค่ามาไอ้เจ้า Array เนี่ยตำแหน่งช่องแรกทางซ้ายไหนติดลบมันจะไม่นับในการคำนวนมันจะข้ามไปเลย
    ตำแหน่งไหนเป็น บวก มันจะเก็บไว้และนำไป บวก กับตำแหน่งถัดไป ดังข้างบน อาเรย์ 1 and 2 
    มันเป็นบวก คือ สอง กับ สาม หลังจากเราผ่านค่าโดยให่ maxSum = maxSum + value แล้ว
    ผลลัพของ maxSum จะเป็นแบบผ่านการคำนวณแล้ว ช่องแรกมันติดลบก็แสดงเท่าเดิม
    ช่องสองเป็น + คือ 2 ก็โชว์ไว้
    ส่วนช่อง 3 นั้นจะได้เป็นผลลัพของ ช่อง 2 + ช่อง 3 คือ 5 
    ส่วนช่องท้ายสุดมันจะเอา 5 ไปคำนวน คือ -9 โปะไป 5 จะเหลือ -4*/
    maxSum; // -1, 2, 5, -4
    maxValue = Math.max(maxValue, maxSum);
    /* หลังจากเราผ่านข้า Math.max แบบข้างบนแล้วเจ้า maxValue จะได้่ผลลัพตามข้างล่าง
    คือ อะไรติดลบ มันจะตีเป็น 0 เลย ช่องแรก 0 ช่องสอง 2 ช่องสาม 5 ช่องสี่มัีนจะโดนเทียบ
    กับช่องก่อนหน้านี้ คือ อะไรมากสุด คือ 5 ช่องสี่เลยจะเท่ากับ 5 
    คำอธิบาย คือ ช่องหลังๆมันจะโดนเทียบกับช่องก่อนหน้านี้ถ้าอะไรมากกว่าก็จะ
    ใช้ค่าที่มากกว่าระบุลงไปในตำแหน่งนั้นๆ */
    maxValue; // 0, 2, 5, 5
    if (maxSum < 0) maxSum = 0;
    /* หลังจากได้ maxValue แล้วเราก็มากรองอีกชั้นโดย maxSum อะไรน้อยกว่า 0
    ก็ตีตกเป็น 0 ไปเลย
    และเราก็ return maxValue ออกไปเลยทีนี้เราก็จะได้ค่าที่มากที่สุดแล้วคือ 5 */
    maxSum; // 0, 2, 5, 0
  }
  return maxValue;
}




console.log(getMaxSubSum([-1, 2, 3, -9]));
